Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::PipeSegmentPreferenceTable::Modifier Class Reference
MEP Element Manager
Modifier of the PipeSegmentPreferenceTable. More...
#include <MEPPipeSegmentPreferenceTable.hpp>
 Inheritance diagram for ACAPI::MEP::PipeSegmentPreferenceTable::Modifier:
 Public Member Functions
void  | SetName (const GS::UniString &tableName)
Sets the name of the table.
Result< void >  | EmptyRow (uint32_t index)
Empties a row from the table.
Result< void >  | EmptyRowByKey (uint32_t referenceId)
Empties a row from the table.
Result< void >  | SetDiameter (uint32_t index, double value)
Sets the diameter value of a table's row.
Result< void >  | SetDiameterByKey (uint32_t referenceId, double value)
Sets the diameter value of a table's row.
Result< void >  | SetWallThickness (uint32_t index, double value)
Sets the wall thickness value of a table's row.
Result< void >  | SetWallThicknessByKey (uint32_t referenceId, double value)
Sets the wall thickness value of a table's row.
Result< void >  | SetDescription (uint32_t index, const GS::UniString &description)
Sets the description of a table's row.
Result< void >  | SetDescriptionByKey (uint32_t referenceId, const GS::UniString &description)
Sets the description of a table's row.
void  | SetUseIndividualSegmentLengths (bool value)
Sets the use of individual segment lengths. If this is false, there will be only one rigid segment for each routing segment, and the minimum and maximum segmentation lengths are ignored when generating routings.
Result< void >  | SetSegmentationLengths (double minimum, double maximum)
Sets the segmentation lengths of the rigid segment. If the segmentation is turned off, the value is ignored when generating routings, and the rigid segment will be the same length as the routing segment.
 Protected Member Functions
Modifier (PipeSegmentPreferenceTable &parent)
Constructs a Modifier with the given PipeSegmentPreferenceTable.
Detailed Description
Modifier of the PipeSegmentPreferenceTable.
Constructor & Destructor Documentation
◆ Modifier()
 ACAPI::MEP::PipeSegmentPreferenceTable::Modifier::Modifier  |  ( |  PipeSegmentPreferenceTable & |  parent | )
protected
Constructs a Modifier with the given PipeSegmentPreferenceTable.
Parameters
parent | The given PipeSegmentPreferenceTable.
Member Function Documentation
◆ EmptyRow()
 Result< void > ACAPI::MEP::PipeSegmentPreferenceTable::Modifier::EmptyRow  |  ( |  uint32_t |  index | )
Empties a row from the table.
Parameters
index | The index of the row. Index starts from 0.
The row itself will not be deleted, only becomes invalid. Invalid rows cannot be used for Pipe route placement / modification.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ EmptyRowByKey()
 Result< void > ACAPI::MEP::PipeSegmentPreferenceTable::Modifier::EmptyRowByKey  |  ( |  uint32_t |  referenceId | )
Empties a row from the table.
Parameters
referenceId | The referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
The row itself will not be deleted, only becomes invalid. Invalid rows cannot be used for Pipe route placement / modification.
Returns
Returns error if the referenceId is not in the table, otherwise nothing.
◆ SetDescription()
 Result< void > ACAPI::MEP::PipeSegmentPreferenceTable::Modifier::SetDescription  |  ( |  uint32_t |  index,
|  const GS::UniString & |  description )
Sets the description of a table's row.
Parameters
index | The index of the row. Index starts from 0.
description | The description to be set.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetDescriptionByKey()
 Result< void > ACAPI::MEP::PipeSegmentPreferenceTable::Modifier::SetDescriptionByKey  |  ( |  uint32_t |  referenceId,
|  const GS::UniString & |  description )
Sets the description of a table's row.
Parameters
referenceId | The referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
description | The description to be set.
If there isn't any row with the given referenceId, but the referenceId is defined in the PipeReferenceSet, it will insert the row.
Returns
Returns error if the referenceId is not in the PipeReferenceSet, otherwise nothing.
◆ SetDiameter()
 Result< void > ACAPI::MEP::PipeSegmentPreferenceTable::Modifier::SetDiameter  |  ( |  uint32_t |  index,
|  double |  value )
Sets the diameter value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
value | The value to be set. Must be a non-zero positive number.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetDiameterByKey()
 Result< void > ACAPI::MEP::PipeSegmentPreferenceTable::Modifier::SetDiameterByKey  |  ( |  uint32_t |  referenceId,
|  double |  value )
Sets the diameter value of a table's row.
Parameters
referenceId | The referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
value | The value to be set. Must be a non-zero positive number.
If there isn't any row with the given referenceId, but the referenceId is defined in the PipeReferenceSet, it will insert the row.
Returns
Returns error if the referenceId is not in the PipeReferenceSet, otherwise nothing.
◆ SetName()
 void ACAPI::MEP::PipeSegmentPreferenceTable::Modifier::SetName  |  ( |  const GS::UniString & |  tableName | )
Sets the name of the table.
Parameters
tableName | The name to be set.
◆ SetSegmentationLengths()
 Result< void > ACAPI::MEP::PipeSegmentPreferenceTable::Modifier::SetSegmentationLengths  |  ( |  double |  minimum,
|  double |  maximum )
Sets the segmentation lengths of the rigid segment. If the segmentation is turned off, the value is ignored when generating routings, and the rigid segment will be the same length as the routing segment.
Parameters
minimum | The minimum segmentation length of the rigid segment.
maximum | The maximum segmentation length of the rigid segment.
Returns
Returns error if any of the parameters are negative, or if the condition minimum * 2 <= maximum is false, otherwise nothing.
◆ SetUseIndividualSegmentLengths()
 void ACAPI::MEP::PipeSegmentPreferenceTable::Modifier::SetUseIndividualSegmentLengths  |  ( |  bool |  value | )
Sets the use of individual segment lengths. If this is false, there will be only one rigid segment for each routing segment, and the minimum and maximum segmentation lengths are ignored when generating routings.
Parameters
value | The value to be set.
◆ SetWallThickness()
 Result< void > ACAPI::MEP::PipeSegmentPreferenceTable::Modifier::SetWallThickness  |  ( |  uint32_t |  index,
|  double |  value )
Sets the wall thickness value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
value | The value to be set. Must be a non-zero positive number.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetWallThicknessByKey()
 Result< void > ACAPI::MEP::PipeSegmentPreferenceTable::Modifier::SetWallThicknessByKey  |  ( |  uint32_t |  referenceId,
|  double |  value )
Sets the wall thickness value of a table's row.
Parameters
referenceId | The referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
value | The value to be set. Must be a non-zero positive number.
If there isn't any row with the given referenceId, but the referenceId is defined in the PipeReferenceSet, it will insert the row.
Returns
Returns error if the referenceId is not in the PipeReferenceSet, otherwise nothing.